snlkuharlocal/src/Documents/РасхожденияКодовМаркировкиМП/РасхожденияКодовМаркировкиМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасхожденияКодовМаркировкиМП</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАктаПриемки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктаПриемки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуОтМП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретПересчетаДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасхожденияМаркировки</name>
    <attributes>
      <name>ШКМаркиКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУКонтрагента</name>
      <type>
        <types>EnumRef.СтатусыМарокУКонтаргента</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>количество штук в маркировке (короб это или штука)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыМарокУКонтаргента/СтатусыМарокУКонтаргента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМарокУКонтаргента</name>
  <enumValues>
    <name>Недосдача</name>
    <comment>Недосдача</comment>
  </enumValues>
  <enumValues>
    <name>Излишек</name>
    <comment>Излишек</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаМаркировки</name>
    <comment>Пример -Товар совпадает, код марки не совпадает</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ПланФакт/ПланФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПланФакт</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>ПланКорректировка</name>
  </enumValues>
  <enumValues>
    <name>БизнесПлан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/УстановкаСтатусаКМ/УстановкаСтатусаКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусаКМ</name>
  <basedOn>Document.РасхожденияКодовМаркировкиМП</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.РасхожденияКодовМаркировкиМП</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусФакт</name>
      <type>
        <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЧЗ</name>
      <type>
        <types>EnumRef.СтатусыКодовМаркировкиИСМП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/РасхожденияКодовМаркировкиМП/ObjectModule.bsl
Перем НачСостНакладной;
Перем НеКонтролироватьЗапись;
Перем НеКонтролироватьТА;
Перем НеВыгружатьДокумент;
Перем НеконтролироватьНаличиеСФ;
Перем НужноВыгружать;
Перем КаталогЕкода, КаталогЕкодаФТП экспорт;
Перем ТЗНеизменяемыхРеквизитов;

Перем ПростоЗаписать; 
Перем тзМарки,МаркиУПД,тзНашиМарки,тзМаркиВБ,ТзРазхождения;
Перем ПризнакРасхождений;

 
Функция ЗаменитьТочку(ИсхЧисло,КолПослеЗапятой)
	
	//Катаев+ 19/12/14
	//СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"");
	СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"; ЧН=");
	//Катаев- 19/12/14
	СтрокаЧ=Строка(СтрокаЧ);
	СтрокаЧ= СтрЗаменить(СтрокаЧ,",",".");
	
	Возврат СтрокаЧ;
	
КонецФункции



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	
	
		
	
	если  ПростоЗаписать=Истина тогда Возврат конецЕсли;
    ТипУзла=ПараметрыСеанса.ТипУзла;
	КодКонтрагента="";
	КодРодителяКонтрагента="";
	
	ЕстьИзменения		=Модифицированность(); 
	
	Если ЕстьИзменения Тогда		
		КоличествоДокумента = ЭтотОбъект.РасхожденияМаркировки.Итог("Количество");
		
	КонецЕсли; 
	
	
	#Если КЛИЕНТ Тогда
		
		Если НЕ ОбменДанными.Загрузка Тогда		
			// упд только в офисе формируются
			Если  ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда			 
				
				// ищем упд, если еще нет, то генерируем.
				сообщить("Запрещено создавать и редактировать документы в офисной базе!");
				Возврат 
				
			КонецЕсли;
			
		КонецЕсли;
	#КонецЕсли	
	//Нечаева 10,06,24 ---
   	//-------------------------------------------------------------------------------------------------------------------------
	
	#Если КЛИЕНТ Тогда
					
		//крохин начало 31.03.2011
		//запретим проводить будущим числом из формы
		Если  НЕ ОбменДанными.Загрузка Тогда
			Если КонецДня(Дата) > КонецДня(ТекущаяДата()) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Сообщить("Невозможно проведение будущей датой");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//крохин конец 31.03.2011
	#КОНЕЦЕСЛИ

	Если ЭтоНовый() И Организация.Пустая()  Тогда
		Организация=справочники.Организации.НайтиПоКоду("SS-001");	
	КонецЕсли;
	
	НадоОтправлять = истина;
	КодДоговора =  ЭтотОбъект.Ссылка.договор.код; 	

	// 08,10,25 нечаева обмен делать не будем  MARK-504
	НужноВыгружать = Ложь;


	//-------------------------------------------------------------------------------------------------------
	//НужноВыгружать	= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);  MARK-504

	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
						
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;       
	
	//MARK-504
	//Если НужноВыгружать Тогда
	//	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	//	Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
	//		НужноВыгружать = Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	
	// распровести ХКМ?
	Если НЕ ОбменДанными.Загрузка Тогда
		
		#если клиент	Тогда
		
			//ХКМ=Неопределено;
			//ХКМ=ПолучитьДокументХКМ(ссылка);
			//			
			//если ЭтотОбъект.ПометкаУдаления = истина Тогда
			//				
			//	Если НЕ ХКМ.Пустая() Тогда
			//		// снимаем проведение
			//		ХКМ_Объект=ХКМ.ПолучитьОбъект();
			//		ХКМ_Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения,РежимПроведенияДокумента.Неоперативный);
			//		
			//	КонецЕсли;		
			//	
			//КонецЕсли;
					
		#конецЕсли
	КонецЕсли;
		
		
КонецПроцедуры


Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь,Очищать=Истина)
	// 2011-11-21 сезонные бонусы ***
	//Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
	//	ИмяРегистра		=НаборДвижений.Ключ;
	//	ТаблицаДвижения =НаборДвижений.Значение;
	//	
	//	Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Продолжить  КонецЕсли; 
	//	
	//	НаборЗаписей=Движения[ИмяРегистра];
	//	// *** 2011-11-21 сезонные бонусы
	//	//НаборЗаписей.Очистить();
	//	// ---------- заменено на:
	//	Если Очищать Тогда
	//		НаборЗаписей.Очистить();
	//	КонецЕсли;
	//	// 2011-11-21 сезонные бонусы ***
	//	
	//	Для Каждого Движение Из ТаблицаДвижения Цикл
	//		Запись=НаборЗаписей.Добавить();	
	//		ЗаполнитьЗначенияСвойств(Запись,Движение);	
	//		
	//		Запись.Регистратор=Ссылка;
	//	КонецЦикла;	
	//	
	////	Если Записывать Тогда
	//		НаборЗаписей.Записать();		
	////	КонецЕсли;
	//КонецЦикла;	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	
	ДвиженияПоРегистрам=Неопределено;
		
	
	//СоздатьХКМ();   
	
	// распроводить хкм, при распроведении.!
    

КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	
	ПростоЗаписать=ложь; 
			
	//
	//Если НачСостНакладной<>СостояниеНакладной Тогда
	//	ЗаписатьИзменениеСостоянияНакладной(Ссылка,СостояниеНакладной);
	//КонецЕсли;

	// формирование ХКМ сделать.
	
КонецПроцедуры

 

Процедура ПрочитатьФайлВБ_Проверка(ФайлОтВБ) Экспорт
	
	Состояние("Чтение файла от ВБ");
	тзМарки.Очистить();
	РасхожденияМаркировки.Очистить();
	тзМаркиВБ.Очистить(); 
	 
	ХКМКДок = ПолучитьДокументХКМ(ссылка);
	Если не хкмКДок.пустая() ТОгда
		//распроведем
		ХКМ1= хкмКДок.получитьОбъект();
		попытка
			хкм1.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		исключение
		КонецПопытки;
	КонецЕсли;	
	
	
	МенеджерXML = Обработки.ПостроительXML.Создать();
	Данные = МенеджерXML.ПрочитатьXDTO(ФайлОтВБ);    
	тзМаркиВБ.Очистить();
	Ном = 0; 
	УчитыватьРасхождения = Истина;  
	
	
	
	// ОснПер,ДокПодтвОтгр - заполнить тоже.	
	Версия = МенеджерXML.ЗначениеСвойстваXDTO(Данные,"ВерсФорм");       
	
	//ИдФайл = МенеджерXML.ЗначениеСвойстваXDTO(Данные,"ИдФайл");
	Документ = МенеджерXML.ЗначениеСвойстваXDTO(Данные,"Документ");
	КНД = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"КНД");
	ВремИнфПр = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"ВремИнфПр");
	ДатаИнфПр = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"ДатаИнфПр");
	ТипУПД = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"Функция");
	СвСчФакт = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"СвСчФакт");  
	Если Версия = "5.01" Тогда
		НомерСчФ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"НомерСчФ");
		ДатаСчФ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"ДатаСчФ");
		КодОКВ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"КодОКВ");	    
	Иначе
		НомерСчФ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"НомерДок");
		ДатаСчФ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"ДатаДок");
		КодОКВ = "643";	    
	КонецЕсли;
	
	//-----------------------------------------------------------------------------------------
	ДокПодтвОтгрНом =  МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"ДокПодтвОтгрНом");
	РеквДатаДок = МенеджерXML.ЗначениеСвойстваXDTO(ДокПодтвОтгрНом,"РеквДатаДок");
	РеквНаимДок = МенеджерXML.ЗначениеСвойстваXDTO(ДокПодтвОтгрНом,"РеквНаимДок");
	РеквНомерДок = МенеджерXML.ЗначениеСвойстваXDTO(ДокПодтвОтгрНом,"РеквНомерДок");
	//-----------------------------------------------------------------------------------------
	Если НомерАктаПриемки ="" Тогда	
		 ЭтотОбъект.НомерАктаПриемки = РеквНомерДок;
		 ЭтотОбъект.ДатаАктаПриемки = СтрокаДаты_ДД_ММ_ГГГГ_ВДату(ДатаСчФ); 
	КонецЕсли;	  
	 
	
	ФХЖ1 =  МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"ИнфПолФХЖ1");
	ТекстИнф = МенеджерXML.ЗначениеСвойстваXDTO(ФХЖ1,"ТекстИнф");
	Если ТипЗнч(ТекстИнф) = Тип("СписокXDTO") Тогда
		Для каждого ЭлементСписка Из ТекстИнф Цикл
			
			ФХЖ1Идентиф = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"Идентиф");
			ФХЖ1Значен = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"Значен");
			
		КонецЦикла;  
	КонецЕсли;
	
	// заявка на поставку, данные до слеша.	
	
	//-------------------------------------------------------------------------------------------
	ТаблСчФакт = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"ТаблСчФакт");  
	
	СведТов = МенеджерXML.ЗначениеСвойстваXDTO(ТаблСчФакт,"СведТов");
	Если ТипЗнч(СведТов) = Тип("СписокXDTO") Тогда
		Для каждого ЭлементСписка Из СведТов Цикл
			НомСтр = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"НомСтр");  
			ДопСведТов = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"ДопСведТов"); 
			ИнфПолФХЖ2 = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"ИнфПОлФХЖ2");
			ЗначенИнф = МенеджерXML.ЗначениеСвойстваXDTO(ИнфПолФХЖ2,"Значен"); 
			// Это ШК контрагента для яндекса
			ИдентифИнф = МенеджерXML.ЗначениеСвойстваXDTO(ИнфПолФХЖ2,"Идентиф");
			
			КодТов = МенеджерXML.ЗначениеСвойстваXDTO(ДопСведТов,"КодТов");  
			Цена = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"ЦенаТов");
			КолТов = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"КолТов");
			Стоимость = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"СтТовБезНДС");
			АртикулТов = МенеджерXML.ЗначениеСвойстваXDTO(ДопСведТов,"АртикулТов");  
			Наименование = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"НаимТов");  
			НомСредИдентТов = МенеджерXML.ЗначениеСвойстваXDTO(ДопСведТов,"НомСредИдентТов");  
			СписокКИЗ = МенеджерXML.ЗначениеСвойстваXDTO(НомСредИдентТов,"КИЗ");
			
			
			//<ИнфПолФХЖ2 Значен="8008583029786" Идентиф="SSKU"/>
			Если ТипЗнч(СписокКИЗ) = Тип("Строка") Тогда
				Ном = Ном + 1;       
				НоваяСтрока = тзМаркиВБ.Добавить();  
				//НоваяСтрока.НомерПП =  Ном;
				НоваяСтрока.Номер =  НомСтр;
				НоваяСтрока.КодТов =  КодТов;   
				НоваяСтрока.Цена =  Цена;
				НоваяСтрока.КолТов =  КолТов;
				НоваяСтрока.Стоимость =  Стоимость;
				НоваяСтрока.Наименование = Наименование;
				НоваяСтрока.АртикулТов = АртикулТов;     
				НоваяСтрока.КИЗ = СписокКИЗ;
				НоваяСтрока.ЗначенИнф = ЗначенИнф;
				НоваяСтрока.ИдентифИнф = ИдентифИнф;
				
				НоваяСтрока.КодТов =  ЗначенИнф; // Это ШК товара
			Иначе		
				Для каждого ЭлементСпискаКИЗ Из СписокКИЗ Цикл
					//КИЗ = ЭлементСпискаКИЗ;	
					Ном = Ном + 1;       
					НоваяСтрока = тзМаркиВБ.Добавить();  
					//НоваяСтрока.НомерПП =  Ном;
					НоваяСтрока.Номер =  НомСтр;
					НоваяСтрока.КодТов =  КодТов;
					НоваяСтрока.Цена =  Цена;
					НоваяСтрока.Стоимость =  Стоимость;
					НоваяСтрока.КолТов =  КолТов;
					НоваяСтрока.Наименование = Наименование;
					НоваяСтрока.АртикулТов = АртикулТов;     
					НоваяСтрока.КИЗ = ЭлементСпискаКИЗ;
					НоваяСтрока.ЗначенИнф = ЗначенИнф;
					НоваяСтрока.ИдентифИнф = ИдентифИнф;
					
					НоваяСтрока.КодТов =  ЗначенИнф; // Это ШК товара
					//ОбработкаПрерыванияПользователя();
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;  
	Иначе 
		// если одна строка в списке
		НомСтр = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"НомСтр");  
		ДопСведТов = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"ДопСведТов");  
		КодТов = МенеджерXML.ЗначениеСвойстваXDTO(ДопСведТов,"КодТов");  
		Цена = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"ЦенаТов");
		Стоимость = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"СтТовБезНДС");
		АртикулТов = МенеджерXML.ЗначениеСвойстваXDTO(ДопСведТов,"АртикулТов");  
		Наименование = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"НаимТов");  
		НомСредИдентТов = МенеджерXML.ЗначениеСвойстваXDTO(ДопСведТов,"НомСредИдентТов");  
		СписокКИЗ = МенеджерXML.ЗначениеСвойстваXDTO(НомСредИдентТов,"КИЗ"); 
		КолТов = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"КолТов");	
		ИнфПолФХЖ2 = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"ИнфПОлФХЖ2");
		ЗначенИнф = МенеджерXML.ЗначениеСвойстваXDTO(ИнфПолФХЖ2,"Значен");
		ИдентифИнф = МенеджерXML.ЗначениеСвойстваXDTO(ИнфПолФХЖ2,"Идентиф");
		
		
		Если ТипЗнч(СписокКИЗ) = Тип("Строка") Тогда
			Ном = Ном + 1;       
			НоваяСтрока = тзМаркиВБ.Добавить();  
			//НоваяСтрока.НомерПП =  Ном;
			НоваяСтрока.Номер =  НомСтр;
			НоваяСтрока.КодТов =  КодТов;
			НоваяСтрока.Цена =  Цена;
			НоваяСтрока.Стоимость =  Стоимость;
			НоваяСтрока.КолТов =  КолТов;
			НоваяСтрока.Наименование = Наименование;
			НоваяСтрока.АртикулТов = АртикулТов;     
			НоваяСтрока.КИЗ = СписокКИЗ; 
			НоваяСтрока.ЗначенИнф = ЗначенИнф;
			НоваяСтрока.ИдентифИнф = ИдентифИнф; 
			НоваяСтрока.КодТов =  ЗначенИнф; // Это ШК товара
		Иначе		
			Для каждого ЭлементСпискаКИЗ Из СписокКИЗ Цикл
				//КИЗ = ЭлементСпискаКИЗ;	
				Ном = Ном + 1;       
				НоваяСтрока = тзМаркиВБ.Добавить();  
				//НоваяСтрока.НомерПП =  Ном;
				НоваяСтрока.Номер =  НомСтр;
				НоваяСтрока.КодТов =  КодТов;
				НоваяСтрока.Цена =  Цена;
				НоваяСтрока.Стоимость =  Стоимость;
				НоваяСтрока.КолТов =  КолТов;
				НоваяСтрока.Наименование = Наименование;
				НоваяСтрока.АртикулТов = АртикулТов;     
				НоваяСтрока.КИЗ = ЭлементСпискаКИЗ;
				НоваяСтрока.ЗначенИнф = ЗначенИнф;
				НоваяСтрока.ИдентифИнф = ИдентифИнф;
				НоваяСтрока.КодТов =  ЗначенИнф; // Это ШК товара
				//ОбработкаПрерыванияПользователя();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Состояние("Обработка файла.");
	
	// с нашими данными не сверяем. Только, что марки наши проверять будем.	
	тзНашиМарки.Очистить();                
	// пока сделаем файл без проверки на наши марки.
	МаркиУПД.Очистить();  // заполним только проверенными?
	ТзРазхождения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
// тут только марки, которые мы нашли у нас
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	втМарки.КИЗ КАК КИЗ
	               	|ПОМЕСТИТЬ втМарки
	               	|ИЗ
	               	|	&тзМарки КАК втМарки
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
	               	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Марка,
	               	|	втМарки.КИЗ КАК КИЗ
	               	|ПОМЕСТИТЬ втМаркиСравнение
	               	|ИЗ
	               	|	втМарки КАК втМарки
	               	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	               	|		ПО втМарки.КИЗ = ШтрихкодыУпаковокТоваров.Наименование
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
	               	|	втМаркиСравнение.КИЗ КАК КИЗ
	               	|ИЗ
	               	|	втМаркиСравнение КАК втМаркиСравнение";           
	
	         	
	Запрос.УстановитьПараметр("тзМарки", тзМаркиВБ);
	Запрос.УстановитьПараметр("пусто", "");
	Запрос.УстановитьПараметр("ВыбКонтрагент",контрагент); // справочники.Контрагенты.НайтиПоКоду("SST-1967")); 
	ДатаСФ = СтрокаДаты_ДД_ММ_ГГГГ_ВДату(ДатаСчФ);

	Запрос.УстановитьПараметр("ВыбДата", ДатаСФ);
	ТЗНайденыУНас = Запрос.Выполнить().Выгрузить();
		
	//----------------------------------------------------------------------------------------------------	
	// проверяем принадлежность РВБ	
	ТЗМаркиУПД = ТЗНайденыУНас.ВыгрузитьКолонку("КИЗ"); // здесь марки, которые попали.  
	
	Запрос = новый запрос; 
	
	// срез последних не подходит, бардак со статусами
	Запрос.Текст = "ВЫБРАТЬ
	               |	втМарки.КИЗ КАК КИЗ
	               |ПОМЕСТИТЬ втМаркиУПД
	               |ИЗ
	               |	&тзМарки КАК втМарки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втМарки.КИЗ КАК КИЗ,
	               |	СУММА(ВЫБОР
	               |			КОГДА СтатусыКМ_Факт.Местонахождение = &вб
	               |					ИЛИ СтатусыКМ_Факт.Местонахождение = &вб2
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПризнакБТК
	               |ПОМЕСТИТЬ втМаркиПр
	               |ИЗ
	               |	втМаркиУПД КАК втМарки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	               |		ПО втМарки.КИЗ = СтатусыКМ_Факт.ШтрихКодУпаковки.Наименование
	             //  |ГДЕ
	             //  |	СтатусыКМ_Факт.Регистратор <> &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втМарки.КИЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втМаркиПр.ПризнакБТК КАК ПризнакБТК,
	               |	втМаркиПр.КИЗ КАК Марка
	               |ИЗ
	               |	втМаркиПр КАК втМаркиПр
	               |ГДЕ
	               |	втМаркиПр.ПризнакБТК = 0";
	
	
	
	
	запрос.УстановитьПараметр("тзМарки",ТЗНайденыУНас);
	запрос.УстановитьПараметр("вб",контрагент); 
	запрос.УстановитьПараметр("Регистратор",ЭтотОбъект.ссылка);
	запрос.УстановитьПараметр("вб2",справочники.Контрагенты.НайтиПоКоду("SST-1208")); 
	
	ТзВБНеПереданные = запрос.Выполнить().Выгрузить();  
	ТзВБНеПереданные.Свернуть("Марка,ПризнакБТК");
	 
    // заполняем ТЧ разницы маркировки.
	Для каждого СтрМ из ТзВБНеПереданные цикл
		
		НстрМ = РасхожденияМаркировки.Добавить();
		НстрМ.ШКМаркиКонтрагента = СтрМ.марка;
		
		// поищем есть ли уже такая марка, если нет, то нужно создавать новую.
		Запрос = новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Наименование КАК Наименование,
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Наименование = &текм";
		запрос.УстановитьПараметр("текм",СтрМ.марка);
		ПоискМарки = запрос.Выполнить().Выгрузить();
		Если ПоискМарки.Количество()= 0  ТОгда
			//	сообщить("новая марка");
			НМарка = справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
		Иначе	
			//сообщить(ПоискМарки[0].ССылка);
			НМарка = ПоискМарки[0].ССылка;
			НстрМ.ШтрихкодУпаковки =НМарка ;
			НстрМ.Товар = НМарка.Владелец;
			НстрМ.количество = 1;
		КонецЕсли;	
		
		Нстрм.СтатусУКонтрагента = перечисления.СтатусыМарокУКонтаргента.Недосдача;
		
	КонецЦикла;
	
	
	ЭтотОбъект.Записать();
	
	// только при проведении делать!
	// обмен документами проверить! 
	
	
	СоздатьУстановкуСтатуса();
	
	
	
	//	СоздатьХКМ();
    
	
КонецПроцедуры //Загрузить


Процедура СоздатьУстановкуСтатуса() Экспорт
	
	
	Если ЭтоНовый() ТОгда
		//сообщить(" Запишите документ! ");
		возврат;
	КонецЕсли;	
	
	Если РасхожденияМаркировки.Количество()=0 ТОгда
		//сообщить("Нет марок для создания ХКМ");
		возврат;
		
	КонецЕсли;   
	
	//----------------------------------
	ДокументХКМ = Документы.УстановкаСтатусаКМ.ПустаяСсылка();  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХранилищеКодовМаркировки.Ссылка КАК Ссылка,
	               |	ХранилищеКодовМаркировки.ДокументОснование КАК ДокОснование
	               |ИЗ
	               |	Документ.УстановкаСтатусаКМ КАК ХранилищеКодовМаркировки
	               |ГДЕ
	               |	ХранилищеКодовМаркировки.ПометкаУдаления = ложь
	               |	И ХранилищеКодовМаркировки.ДокументОснование = &текдок";
	запрос.УстановитьПараметр("ТекДок",ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() тогда
		ДокументХКМ = рез.ссылка.получитьОбъект();
		ДокументХКМ.ШтрихкодыУпаковок.очистить();
	иначе
		ДокументХКМ = документы.УстановкаСтатусаКМ.СоздатьДокумент();
		//Создать_ХКМ_к_ПНК_План(ДокументДляЗагрузки);
		ДокументХКМ.Автор = ПараметрыСеанса.Пользователь;
		ДокументХКМ.ДокументОснование = ссылка;
		ДокументХКМ.Организация = организация;
		ДокументХКМ.Дата = ТекущаяДата();	
		ДокументХКМ.Местонахождение = контрагент; 
		ДокументХКМ.Комментарий = "Передача марок МП (для РВБ), не переданные марки";
		ДокументХКМ.УстановитьНовыйНомер( "PPP"+"-");
	КонецЕсли;	   

	// заполняем марками
	//-------------------------------------------
	Для каждого ТекстрМ из РасхожденияМаркировки Цикл
		
		МаркаН = ДокументХКМ.ШтрихкодыУпаковок.добавить();
		МаркаН.ШтрихкодУпаковки = ТекстрМ.ШтрихкодУпаковки;
		МаркаН.СтатусФакт = перечисления.СтатусыКодовМаркировкиФакт.ОтгруженПокупателю;
	//	маркаН.СтатусЧЗ = перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован; // ????
		
	КонецЦикла;

	попытка
	ДокументХКМ.Записать(); // РежимЗаписиДокумента.Проведение
	исключение
		Сообщить(ОписаниеОшибки());
		возврат;
	конецПопытки;
	              
	//сообщить(ДокПолучатель);
	сообщить("  ХКМ "+ ДокументХКМ);
	//-----------------------------------------------

	
КонецПроцедуры

 

Процедура СоздатьХКМ();
	возврат;
	
	Если ЭтоНовый() ТОгда
		//сообщить(" Запишите документ! ");
		возврат;
	КонецЕсли;	
	
	Если РасхожденияМаркировки.Количество()=0 ТОгда
		//сообщить("Нет марок для создания ХКМ");
		возврат;
		
	КонецЕсли;   
	
	//----------------------------------
	ДокументХКМ = Документы.ХранилищеКодовМаркировки.ПустаяСсылка();  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХранилищеКодовМаркировки.Ссылка КАК Ссылка,
	               |	ХранилищеКодовМаркировки.ПланФакт КАК ПланФакт,
	               |	ХранилищеКодовМаркировки.Проведен КАК Проведен,
	               |	ХранилищеКодовМаркировки.ДокОснование КАК ДокОснование
	               |ИЗ
	               |	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
	               |ГДЕ
	               |	ХранилищеКодовМаркировки.ПометкаУдаления = ложь
	               |	И ХранилищеКодовМаркировки.ДокОснование = &текдок
	               |	И ХранилищеКодовМаркировки.ПланФакт = &план";
	запрос.УстановитьПараметр("ТекДок",ссылка);
	запрос.УстановитьПараметр("План",Перечисления.ПланФакт.Факт);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() тогда
		ДокументХКМ = рез.ссылка.получитьОбъект();
		ДокументХКМ.ШтрихкодыУпаковок.очистить();
	иначе
		ДокументХКМ = документы.ХранилищеКодовМаркировки.СоздатьДокумент();
		//Создать_ХКМ_к_ПНК_План(ДокументДляЗагрузки);
		ДокументХКМ.Автор = ПараметрыСеанса.Пользователь;
		ДокументХКМ.ДокОснование = ссылка;
		ДокументХКМ.Организация = организация;
		ДокументХКМ.ПланФакт = перечисления.ПланФакт.Факт;
		ДокументХКМ.КодОперации = перечисления.КодыОперацийОстатки.Реализация;
	//	ДокументХКМ.Отправитель = Склад.Подразделение; 
		
		ДокументХКМ.Получатель = контрагент; 
		ДокументХКМ.Комментарий = "Передача марок МП (для РВБ), не переданные марки";
		ДокументХКМ.дата = дата;
		ДокументХКМ.УстановитьНовыйНомер( "PPP"+"-");
	КонецЕсли;	   
	// Префикс = Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
	
	
	// заполняем марками
	//-------------------------------------------
	Для каждого ТекстрМ из РасхожденияМаркировки Цикл
		
		МаркаН = ДокументХКМ.ШтрихкодыУпаковок.добавить();
		МаркаН.ШтрихкодУпаковки = ТекстрМ.ШтрихкодУпаковки;
		
	КонецЦикла;

	попытка
	ДокументХКМ.Записать(РежимЗаписиДокумента.Проведение);
	исключение
		//Сообщить(ОписаниеОшибки());
		возврат;
	конецПопытки;
	              
	//сообщить(ДокПолучатель);
	//сообщить("  ХКМ "+ ДокументХКМ);
	//-----------------------------------------------

	
КонецПроцедуры




Функция ПолучитьДокументХКМ(ссылка);
		
	//----------------------------------
	ДокументХКМ = Документы.ХранилищеКодовМаркировки.ПустаяСсылка();  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХранилищеКодовМаркировки.Ссылка КАК Ссылка,
	               |	ХранилищеКодовМаркировки.ПланФакт КАК ПланФакт,
	               |	ХранилищеКодовМаркировки.Проведен КАК Проведен,
	               |	ХранилищеКодовМаркировки.ДокОснование КАК ДокОснование
	               |ИЗ
	               |	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
	               |ГДЕ
	               |	//ХранилищеКодовМаркировки.Проведен = ИСТИНА
	               |	ХранилищеКодовМаркировки.ДокОснование = &текдок
	               |	И ХранилищеКодовМаркировки.ПланФакт = &план
	               |	И ХранилищеКодовМаркировки.ПометкаУдаления = ложь";
	запрос.УстановитьПараметр("ТекДок",ссылка);
	запрос.УстановитьПараметр("План",Перечисления.ПланФакт.Факт);
	
	Рез = Запрос.Выполнить().Выбрать();

	Если  рез.Следующий() ТОгда
		
		возврат ссылка
		
	иначе
		возврат Документы.ХранилищеКодовМаркировки.ПустаяСсылка();
	конецЕсли;
	
	
		
КонецФункции



Функция СтрокаДаты_ДД_ММ_ГГГГ_ВДату(Строка)
    Д = Число(Сред(Строка, 1, 2));
    М = Число(Сред(Строка, 4, 2));
    Г = Число(Сред(Строка, 7, 4));
    Возврат Дата(Г, М, Д);
    
КонецФункции 


Функция ТаблицаЗначенийВТабличныйДокумент(ТаблицаДанных)
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ВыводитьЗаголовокОтчета = Ложь;
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанных);
	ДокументРезультат = Новый ТабличныйДокумент;
	Оформление = ПолучитьМакетОформления(СтандартноеОформление.Асфальт);
	ПостроительОтчета.МакетОформления = Оформление;
	УФ = ПостроительОтчета.УсловноеОформление;
	УФ.Очистить();
	
	ПостроительОтчета.Выполнить();
	ПостроительОтчета.ОформитьМакет();    
	Построительотчета.Вывести(ДокументРезультат);
	Возврат ДокументРезультат;
	
КонецФункции


Функция РазницаТаблицЗначений(Таблица0, Таблица1, Измерения) Экспорт
	состояние("Сверка кодов");
	ВсеКолонки = "";
	Для Каждого Колонка Из Таблица0.Колонки Цикл 
		ВсеКолонки = ВсеКолонки + ", " + Колонка.Имя
	КонецЦикла;
	ВсеКолонки = Сред(ВсеКолонки, 2);
	
	Таблица = Таблица1.Скопировать();    
	
	Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
	
	Таблица.ЗаполнитьЗначения(1, "Знак"); // принадлежность к нашей или их таблице.
	
	Для Каждого Строка Из Таблица0 Цикл ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка) КонецЦикла;
	
	Таблица.Колонки.Добавить("Счёт");
	Таблица.ЗаполнитьЗначения(1, "Счёт"); // признак, что дубли
	
	Таблица.Свернуть(ВсеКолонки, "Знак, Счёт");   
	//Таблица = новый таблицаЗначений;
	//таблица.колонки.Удалить(1);
	
	Ответ = Таблица.Скопировать(Новый Структура("Счёт", 1), ВсеКолонки + ", Знак");
	ТаблицаМарокХКМ = Таблица.Скопировать(Новый Структура("Счёт", 2), ВсеКолонки + ", Знак"); // только марки, которые совпадают и у них, и у нас.

	Ответ.Сортировать(Измерения);
	Ответ.колонки.добавить("НеНайдено");
	Для каждого Строка из Ответ цикл
		Если Строка.Знак = 1 ТОгда Строка.НеНайдено = "нет в нашем файле"; Иначе Строка.НеНайдено = "нет в файле ВБ";   конецЕсли;	
	КонецЦикла;
	// Ответ.колонки.Удалить(1);
	
	Возврат Ответ
	
КонецФункции






Процедура ПриКопировании(ОбъектКопирования)	
	Организация			=Неопределено;
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	
	ЭтотУзел = ПараметрыСеанса.ЭтотУзел;
	
	Если Менеджер.Пустая() Тогда
		Менеджер=Контрагент.Менеджер;
	КонецЕсли;
	
	Подразделение = Менеджер.Подразделение;
		
	Если Договор.Пустая() Или Договор.НеИспользовать Тогда
		Договор=Контрагент.ОсновнойДоговор;			
	КонецЕсли; 
	
	
КонецПроцедуры



ТзРазхождения = новый ТаблицаЗначений;
тзМаркиУПД = Новый ТаблицаЗначений; 
тзНашиМарки = Новый ТаблицаЗначений;
тзМаркиВБ = Новый ТаблицаЗначений; 


тзМарки = Новый ТаблицаЗначений; 
тзМарки.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
тзМарки.Колонки.Добавить("КодТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
тзМарки.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМарки.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));	
тзМарки.Колонки.Добавить("АртикулТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМарки.Колонки.Добавить("Цена", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМарки.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМарки.Колонки.Добавить("ЗначенИнф", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМарки.Колонки.Добавить("ИдентифИнф", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМарки.Колонки.Добавить("КолТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	

тзМарки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
тзМарки.Колонки.Добавить("Модель", новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	




тзМаркиВБ = Новый ТаблицаЗначений;
тзМаркиВБ.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
тзМаркиВБ.Колонки.Добавить("КодТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));	
тзМаркиВБ.Колонки.Добавить("АртикулТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("Цена", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМаркиВБ.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("ЗначенИнф", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМаркиВБ.Колонки.Добавить("ИдентифИнф", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("КолТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	


тзНашиМарки = Новый ТаблицаЗначений;
тзНашиМарки.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
тзНашиМарки.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));


НераспознанныеМаркиВБ = Новый ТаблицаЗначений;
НераспознанныеМаркиВБ.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
НераспознанныеМаркиВБ.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
НераспознанныеМаркиВБ.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));	
НераспознанныеМаркиВБ.Колонки.Добавить("КодТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));


ОтсутствуютВМаркиВБ = Новый ТаблицаЗначений;
ОтсутствуютВМаркиВБ.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
ОтсутствуютВМаркиВБ.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));


МаркиУПД = Новый ТаблицаЗначений;
МаркиУПД.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
МаркиУПД.Колонки.Добавить("КодТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
МаркиУПД.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
МаркиУПД.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));	
МаркиУПД.Колонки.Добавить("АртикулТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	

 
 
 
 
 
 
 
 
 
 


НеКонтролироватьЗапись	=Ложь;
НеКонтролироватьТА		=Ложь;
//крохин начало 15.02.2013
НеВыгружатьДокумент = Ложь;
//крохин конец 15.02.2013
//крохин начало 15.04.2013
НеконтролироватьНаличиеСФ = Ложь;
//крохин конец 15.04.2013
// нечаева 130122 ++
КаталогЕкода = Константы.КаталогЕКОД.Получить(); //\\SRVECOD\SFERAConnector2\EDI\
КаталогЕкодаФТП = "\\SRVECOD-C\SFERAConnector\EDI\";  // для уведомлений филиала
// нечаева 130122---
